{
  "logoWidth": 100,
  "dateFormat": "yyyy",
  "dataArray": [
    {
      "name": "Resume",
      "bullets": [
        "A React application (this website) which is used to showcase skills, employment, education, and projects.",
        "### Goals\n1. Build a personal website consuming the `resume-template` component library I built",
        "### Skills Acquired\n1. Automatic `GitHub pages` released on pushing tags.\n2. Component library development experience"
      ],
      "startDate": "7/1/2021",
      "website": "https://github.com/tommy-lettieri/resume",
      "logoURL": "https://media-exp1.licdn.com/dms/image/C4E03AQFSrF7safIxJg/profile-displayphoto-shrink_200_200/0/1593486427588?e=1631145600&v=beta&t=msdDA--YsOEI4U-nEkbu4mlaGcqRA9HQWNWQm1lYz4o"
    },
    {
      "name": "Resume Template",
      "bullets": [
        "A React component library for this website. Pushes for reuse by allowing installation over forking.",
        "### Goals\n1. Instead of giving a template to fork I wanted to build a set of components that people could use as they liked.\n2. Furthermore for simplicity I wanted components that would represent the entire website to make it easier to get something up and running.\n3. Automatic resume pdf generation from a subset of the data (in progress)",
        "### Skills Acquired\n1. Learned how to build a React component library\n2. Learned to use rollup to package up said library (although currently having some issues with a dependency)\n3. Learned how to use storyboard to build and view components in isolation\n4. Furthered my understanding to use React Contexts"
      ],
      "startDate": "7/1/2021",
      "website": "https://github.com/tommy-lettieri/resume",
      "logoURL": "/images/react-lib.png"
    },
    {
      "name": "Resume Template CLI (lib)",
      "bullets": [
        "A Typescript module dev utility for this website. Used for initialization and data validation.",
        "### Goals\n1. I wanted a way for people to initialize certain settings when using the `resume-template-library` (default json files, github actions, styles, etc.)\n2. I wanted people to be able to validate that their JSON files were correct",
        "### Skill Acquired\n1. Learned how to expose an npm module as a cli"
      ],
      "startDate": "7/1/2021",
      "website": "https://github.com/tommy-lettieri/resume-template-cli",
      "logoURL": "/images/node-lib.png"
    },
    {
      "name": "Mass Texter",
      "bullets": [
        "Android application that texts a group of contacts with a loop.",
        "### Goals\n1. My phone provider capped the number of people I could text to 10 at one time (regardless of mass or group texts.), however I wanted to text 30 people at a time.\n2. Sending a mass text would go out on a thread with everyone but responses would come back individually so context was sometimes unclear. I wanted the interaction to be more clear.",
        "### Outcome\n1. People were more responsive (due to the fact that they thought I was texting them personally).",
        "### Unimplemented ideas\n1. Templating: Having the ability to replace things like `{NAME}` with the contact name.",
        "### Skills Acquired\n1. Query contacts on android\n2. Send text messages from android"
      ],
      "startDate": "7/1/2017",
      "website": "https://github.com/tommy-lettieri/MassTexter",
      "logoURL": "https://github.com/tommy-lettieri/MassTexter/blob/master/app/src/main/res/mipmap-hdpi/ic_launcher.png?raw=true"
    },
    {
      "name": "Interval Clock",
      "bullets": [
        "Android application to play a sound at a regular interval.",
        "### Goals\n1. I wanted a timer that would go off consistent at a given interval\n2. This was intended for something like timing exercises (for instance to keep break times short you could give yourself the remainder of an interval and maybe an additional without disrupted and going to you phone and getting distracted.)",
        "### Skills Acquired\n1. Programmatically worked with Android's canvas APIs"
      ],
      "startDate": "7/1/2017",
      "website": "https://github.com/tommy-lettieri/IntervalClock",
      "logoURL": "https://github.com/tommy-lettieri/IntervalClock/blob/master/app/src/main/res/mipmap-hdpi/ic_launcher.png?raw=true"
    },
    {
      "name": "Stay Awake",
      "bullets": [
        "Android widget to keep Android screen active.",
        "### Goals\n1. Build a widget to make it easier to turn screen timeout off. This is useful when playing games like Fibbage on Jackbox where there is a wait time while the tv goes through the prompts. This is also useful if you are exercising and keeping an eye on a stopwatch.",
        "### Skills Acquired\n1. Learned to build a widget for android."
      ],
      "startDate": "7/1/2017",
      "website": "https://github.com/tommy-lettieri/StayAwake",
      "logoURL": "https://github.com/tommy-lettieri/StayAwake/blob/master/app/src/main/res/mipmap-hdpi/ic_launcher.png?raw=true"
    }
  ]
}